<template>
  <div class="content">
    <h2>Тестовое задание для компании Paymart</h2>
    <br>
    <br>

    <h3>Задание</h3>
    <br>
    <br>
    <p>Написать Single page application на Vue.js 2, представляющий из себя прототип сайта для отслеживания дел.</p>
    <p>Сайт должен состоять из трёх страниц:</p>
    <br>
    <br>

    <ul class="ul">
      <li>
        1. Страница постановки задачи:
        <ul class="ul">
          <li>° Текстовые поля с валидацией для ввода названия задачи, тегов (произвольно) и описания (до 2048 символов).</li>
          <li>° Поле типа datepicker для указания дедлайна задачи</li>
          <li>° Кнопка, сохраняющая задачу в браузере, чтобы она была доступна между сессиями</li>
          <li>° Созданная задача получает статус «в работе»</li>
        </ul>
      </li>
      <li>
        2. Страница вывода задач
        <ul class="ul">
          <li>° Список задач с информацией о ней. Если описание не влезает - оно должно быть
            обрезано (без использования JS).</li>
          <li>° Фильтр по статусу задачи, а также по просроченным задачам</li>
        </ul>
      </li>
      <li>
        3. Страница вывода задачи
        <ul class="ul">
          <li>° Изменение описания, времени дедлайна</li>
          <li>° Перевод задачи в статус «завершено»</li>
        </ul>
      </li>
    </ul>
  </div>
</template>